package Prednaznachenie;
import static Prednaznachenie.Sum.*;
import static Prednaznachenie.Print.*;

public class Calculation {
	
	
//	public static void Claculate(int i, int w, int s){	
	//return c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,c48,c49,50,c51,c52,c53,c54,c55,c56,c57,c58,c59,c60,c61,c62,c63,c64,c65,c66,c67,c68,c69,c70,c71,c72,c73,c74,c75,c76,c77,c78,c79,c80,c81,c82,c83,c84,c85,c86,c87,c88,c89,c90,c91,c92,c93;
public static void main(String[] args){
///////////////////////////////////////////////////////////	
int a=16; 	//день рождения
int b=9;	//месяц рождения
int c=1989;	//год рождения
//////////////////////////////////////////////////////////
int c1=Sum(a);								
int c2=Sum(b);						
int c3=Sum(c);						
int c4=Sum(c1, c2, c3);				
int c5=Sum(c1,c2,c3,c4);			
int c6=Sum(c2,c4);					
int c7=Sum(c1,c3);					
int c8=Sum(c6,c7);
//Диагональный квадрат
int c9=Sum(c1,c2);
int c10=Sum(c2,c3);
int c11=Sum(c3,c4);
int c12=Sum(c1,c4);
int c13=Sum(c9,c11);
int c14=Sum(c10,c12);
int c15=Sum(c13,c14);
int c16=Sum(c8, c15);
//кармический хвост
int c17=Sum(c4,c5);
int c18=Sum(c17+c5);      	//Не уверен, +10?
//Партнерство и деньги
int c19=Sum(c3,c5);
int c20=Sum(c17,c19);
int c21=Sum(c20,c19);
//Любовные отношения
int c23=Sum(c17,c20);
//чакры и здоровье
int c24=Sum(c2,c5);
int c25=Sum(c2, c24);
int c26=Sum(c5,c24);
//физическое состояние органов
int c27=Sum(c1,c5);
int c28=Sum(c1,c27);
int c29=Sum(c5,c27);
int c30=Sum(c1,c2);
int c31=Sum(c25,c28);
int c32=Sum(c24,c27);
int c33=Sum(c26,c29);
int c34=Sum(c5,c5);
int c35=Sum(c17,c19);
int c36=Sum(c3,c4);
int c37=Sum(c30,c31,c32,c33,c34,c35,c36);
//Просчеты по годам
int c38=Sum(c1,c9);
int c39=Sum(c1,c38);
int c40=Sum(c1,c39);
int c41=Sum(c39,c38);
int c42=Sum(c9,c38);
int c43=Sum(c42,c38);
int c44=Sum(c42, c9);
int c45=Sum(c9,c2);
int c46=Sum(c9,c45);
int c47=Sum(c9,c46);
int c48=Sum(c2,c46);
int c49=Sum(c45,c2);
int c50=Sum(c45,c49);
int c51=Sum(c49,c45);
int c52=Sum(c2, c10);
int c53=Sum(c2,c52);
int c54=Sum(c2,c53);
int c55=Sum(c52,c53);
int c56=Sum(c52,c10);
int c57=Sum(c52,c56);
int c58=Sum(c56,c10);
int c59=Sum(c10,c3);
int c60=Sum(c10,c59);
int c61=Sum(c10,c60);
int c62=Sum(c59,c60);
int c63=Sum(c59,c3);
int c64=Sum(c63,c3);
int c65=Sum(c59,c63);
int c66=Sum(c3,c11);
int c67=Sum(c3,c66);
int c68=Sum(c3,c67);
int c69=Sum(c66,c67);
int c70=Sum(c66,c11);
int c71=Sum(c66,c70);
int c72=Sum(c70,c11);
int c73=Sum(c11,c4);
int c74=Sum(c11,c73);
int c75=Sum(c11,c74);
int c76=Sum(c74,c73);
int c77=Sum(c73,c4);
int c78=Sum(c73,c77);
int c79=Sum(c77,c4);
int c80=Sum(c4,c12);
int c81=Sum(c4,c80);
int c82=Sum(c4,c81);
int c83=Sum(c81,c80);
int c84=Sum(c80,c12);
int c85=Sum(c80,c84);
int c86=Sum(c84,c12);
int c87=Sum(c12,c1);
int c88=Sum(c12,c87);
int c89=Sum(c12,c88);
int c90=Sum(c88,c87);
int c91=Sum(c87,c1);
int c92=Sum(c87,c91);
int c93=Sum(c91,c1);

//return c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13,c14,c15,c16,c17,c18,c19,c20,c21,c22,c23,c24,c25,c26,c27,c28,c29,c30,c31,c32,c33,c34,c35,c36,c37,c38,c39,c40,c41,c42,c43,c44,c45,c46,c47,c48,c49,50,c51,c52,c53,c54,c55,c56,c57,c58,c59,c60,c61,c62,c63,c64,c65,c66,c67,c68,c69,c70,c71,c72,c73,c74,c75,c76,c77,c78,c79,c80,c81,c82,c83,c84,c85,c86,c87,c88,c89,c90,c91,c92,c93;
print("День рождения "+a+"."+b+"."+c);	
print("Визитная карточка личности - "+c1+"-й аркан.");
	print("Духовная сверхзадача и число ангела-хранителя - "+c2+"-й акран.");
	print("Энергия-подарок при выполнении 1-го предназначения - "+c3+"-й аркан.");
	print("Программа судьбы (что не проработано в прошлой жизни "+c4+"-й аркан.");
	print("Точка комфорта (Центральная энергия души) "+c5+"-й аркан.");
	print("Небо. Ваша энергетическая задача, духовная, нематериальная. Это Ваш личностный рост и все, что касается Ваших эмоций, чувств, мечтаний, мыслей. "+c6+"-й аркан.");
	print("Земля. Материальный мир, здоровье, секс, финансы, карьера, бизнес. "+c7+"-й аркан.");
	print("Первое предназначение. до 40 лет. "+c8+"-й аркан");
	print("Второе предназначение. То, что нужно отдать своему роду и людям. Переданые от рода энергии в 'минусе'. Миссия от 40-60лет. "+c15+"-й аркан");
	print("Общее предназначение. Тема жизни, ресурс, потенциал. До 60 лет - то в плюсе, то в минусе, но после 60 - она дается нам в награду либо в наказание в зависимости от выполнения 1-го и 2-го предназначения. "+c2+"-й аркан");
	print("Кармический хвост в "+c4+", "+c17+", "+c18+"-м арканах");
	print("Партнерство и денги "+c19+", "+c20+", "+c21+"-е арканы");
	print("Вход в денежный канал. Через "+c19+"-й акран");
	print("Вход в партнерские отношения, неотработанная энергия из прошлой жизни - "+c20+"-й аркан.");
	print("Приток денежных средств - через "+c21+"-й аркан");
	print("Построение любовных отношений - "+c23+", "+c17+" "+c20+"-е арканы");
	print("");
	print("За 1-ю чакру МУЛАДХАРУ отвечает "+c3+"-й аркан физики и "+c4+"-й аркан неба");
	print("За 2-ю чакру СВАДХИСТАНУ отвечает "+c19+"-й аркан физики и "+c17+"-й аркан неба");
	print("За 3-ю чакру МАНИПУРУ отвечает "+c5+"-й аркан физики и "+c5+"-й аркан неба");
	print("За 4-ю чакру АНАХАТУ отвечает "+c29+"-й аркан физики и "+c26+"-й аркан неба");
	print("За 5-ю чакру ВИШУДХУ отвечает "+c27+"-й аркан физики и "+c24+"-й аркан неба");
	print("За 6-ю чакру АДЖНУ отвечает "+c28+"-й аркан физики и "+c25+"-й аркан неба");
	print("За 7-ю чакру САХАСРАРУ отвечает "+c2+"-й аркан физики и "+c1+"-й аркан неба");
	print(c37+"-й аркан отвечает за все системы человека - кровоносную, нервную, имунную, кожную, вегето-сосудистую, костную. То есть за то, что расположено по всему телу.");
	print("");
	print("Арканы по возрастам: ");
	print("0лет = 80 лет - 	 "+c1+"-й аркан");
	print("1год и 3 месяца -	 "+c40+"-й аркан");
	print("2года, 6 месяца -	 "+c39+"-й аркан");
	print("3года, 9месяцев -	 "+c39+"-й аркан");
	print("5лет -			 "+c38+"-й аркан");
	print("6лет и 3 месяца -	 "+c43+"-й аркан");
	print("7лет и 6 месяцев -	 "+c42+"-й аркан");
	print("8лет и 9 месяцев -  	 "+c44+"-й аркан");
	print("10лет -			 "+c9+"-й аркан");
	print("11лет и 3 месяца -	 "+c47+"-й аркан");
	print("12лет, 6 месяца -	 "+c46+"-й аркан");
	print("13лет, 9месяцев -	 "+c48+"-й аркан");
	print("15лет -			 "+c45+"-й аркан");
	print("16лет и 3 месяца -	 "+c50+"-й аркан");
	print("17лет и 6 месяцев -	 "+c49+"-й аркан");
	print("18лет и 9 месяцев -	 "+c51+"-й аркан");
	print("20лет -			 "+c2+"-й аркан");
	print("21год и 3 месяца -	 "+c54+"-й аркан");
	print("22года, 6 месяца -	 "+c53+"-й аркан");
	print("23года, 9месяцев -	 "+c55+"-й аркан");
	print("25лет -			 "+c52+"-й аркан");
	print("26лет и 3 месяца -	 "+c57+"-й аркан");
	print("27лет и 6 месяцев -	 "+c56+"-й аркан");
	print("28лет и 9 месяцев -	 "+c58+"-й аркан");
	print("30лет -			 "+c10+"-й аркан");
	print("31год и 3 месяца -	 "+c61+"-й аркан");
	print("32года, 6 месяца -	 "+c60+"-й аркан");
	print("33года, 9месяцев -	 "+c62+"-й аркан");
	print("35лет -			 "+c59+"-й аркан");
	print("36лет и 3 месяца -	 "+c65+"-й аркан");
	print("37лет и 6 месяцев -	 "+c63+"-й аркан");
	print("38лет и 9 месяцев -	 "+c64+"-й аркан");
	print("40лет -			 "+c3+"-й аркан");
	print("41год и 3 месяца -	 "+c68+"-й аркан");
	print("42года, 6 месяца -	 "+c67+"-й аркан");
	print("43года, 9месяцев -	 "+c69+"-й аркан");
	print("45лет -			 "+c66+"-й аркан");
	print("46лет и 3 месяца -	 "+c71+"-й аркан");
	print("47лет и 6 месяцев -	 "+c70+"-й аркан");
	print("48лет и 9 месяцев -	 "+c72+"-й аркан");
	print("50лет -			 "+c11+"-й аркан");
	print("51год и 3 месяца -	 "+c75+"-й аркан");
	print("52года, 6 месяца -	 "+c74+"-й аркан");
	print("53года, 9месяцев -	 "+c76+"-й аркан");
	print("55лет -			 "+c73+"-й аркан");
	print("56лет и 3 месяца -	 "+c78+"-й аркан");
	print("57лет и 6 месяцев -	 "+c77+"-й аркан");
	print("58лет и 9 месяцев -	 "+c79+"-й аркан");
	print("60лет -			 "+c4+"-й аркан");
	print("61год и 3 месяца -	 "+c82+"-й аркан");
	print("62года, 6 месяца -	 "+c81+"-й аркан");
	print("63года, 9месяцев -	 "+c83+"-й аркан");
	print("65лет -			 "+c80+"-й аркан");
	print("66лет и 3 месяца -	 "+c85+"-й аркан");
	print("67лет и 6 месяцев -	 "+c84+"-й аркан");
	print("68лет и 9 месяцев -	 "+c86+"-й аркан");
	print("70лет -			 "+c12+"-й аркан");
	print("71год и 3 месяца -	 "+c89+"-й аркан");
	print("72года, 6 месяца -	 "+c88+"-й аркан");
	print("73года, 9месяцев -	 "+c90+"-й аркан");
	print("75лет -			 "+c87+"-й аркан");
	print("76лет и 3 месяца -	 "+c92+"-й аркан");
	print("77лет и 6 месяцев -	 "+c91+"-й аркан");
	print("78лет и 9 месяцев -	 "+c93+"-й аркан");
	print("80лет -			 "+c1+"-й аркан");
	
	
	
}
}


///:~
